package lesson20.homework;

public class Task3 {
    public static void main(String[] args) {
/*
Напишите программу, которая помогает пользователю рассчитать общую стоимость поездки на автомобиле.
Программа должна запрашивать у пользователя информацию о расстоянии до пункта назначения, расходе топлива на 100 км,
цене топлива за литр и выводить итоговую стоимость поездки.
Программа должна использовать методы и конкатенацию строк.
Создайте метод getTripInfo(), который будет: Запрашивать у пользователя расстояние до пункта назначения (в км),
расход топлива на 100 км (в литрах) и цену топлива за литр.
Сохранять эти данные в отдельные переменные.
Вызывать метод calculateFuelCost(double distance, double fuelConsumption, double fuelPrice),
который будет: Возвращать общую стоимость топлива для поездки.
Затем метод getTripInfo() должен вызвать метод generateTripReport
(double distance, double fuelConsumption, double fuelPrice, double totalCost),
который будет: Выводить отчёт о стоимости поездки, используя конкатенацию строк.
 */
    }
}
