package lesson20.homework;

public class Task2 {
    public static void main(String[] args) {
/*
Бананы стоят 11 у.е., яблоки - 8 у.е. Вам нужно купить два килограмма бананов и три килограмма яблок.
Сохраните все эти данные в переменных. Напишите программу, которая выводит на экран фразу
"Для покупки Х килограммов бананов и Х килограммов яблок мне нужно Х у.е."
В местах, где Х - нужно воспользоваться переменными.
Напишите отдельный метод, который считает и возвращает стоимость продукта
и воспользуйтесь им два раза для расчёта стоимости яблок и бананов.
 */
    }
}
