package lesson34StreamAPI.homework.task2;

public class Main {
    public static void main(String[] args) {
        /*
        Создайте класс Customer (покупатель).
Покупатель должен обладать характеристиками: имя, возраст, количество покупок.
Создайте лист и наполните его десятью покупателями с разными именами, в возрасте от 20 до 80 лет,
количество покупок - от 1 до 5.
Представьте, что есть магазин, который проводит акцию. Задача - определить победителей акции и вывести их в консоль.
Условия акции: побеждают два человека пенсионного возраста (от 65 лет включительно),
которые совершили минимум 3 покупки в магазине.
Важное уточнение: одинаковые покупатели два раза к участию в акции не допускаются.
Задание должно быть решено при помощи одного стрима.
         */
    }
}
